app/controllers/comments_controller.rb

    def edit
        @comment = Article.find(params[:article_id]).comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 2], ["id", 4], ["LIMIT", 1]]

    def update
        byebug
        @comment = Comment.find(params[:id])
        if @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "comments" SET "commenter" = ?, "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["commenter", "Talha"], ["body", "lora"], ["updated_at", "2020-08-05 13:26:41.218120"], ["id", 4]]